DELETE FROM PositionsResponsibilities;
INSERT INTO PositionsResponsibilities (PositionId, ResponsibilityId)
SELECT p.Id, r.Id
FROM (
         VALUES
             (N'Вчитель математики', N'Вчитель математики'),
             (N'Вчитель математики', N'Класний керівник'),
             (N'Вчитель української мови та літератури', N'Вчитель української мови та літератури'),
             (N'Вчитель української мови та літератури', N'Класний керівник'),
             (N'Вчитель англійської мови', N'Вчитель англійської мови'),
             (N'Вчитель англійської мови', N'Класний керівник'),
             (N'Вчитель історії', N'Вчитель історії'),
             (N'Вчитель історії', N'Класний керівник'),
             (N'Вчитель фізики', N'Вчитель фізики'),
             (N'Вчитель хімії', N'Вчитель хімії'),
             (N'Вчитель біології', N'Вчитель біології'),
             (N'Вчитель географії', N'Вчитель географії'),
             (N'Вчитель інформатики', N'Вчитель інформатики'),
             (N'Вчитель інформатики', N'Класний керівник'),
             (N'Вчитель фізичної культури', N'Вчитель фізичної культури'),
             (N'Вчитель музики', N'Класний керівник'),
             (N'Вчитель початкових класів', N'Класний керівник'),
             (N'Класний керівник', N'Класний керівник'),
             (N'Заступник директора з навчальної роботи', N'Заступник директора з навчальної роботи'),
             (N'Заступник директора з виховної роботи', N'Заступник директора з виховної роботи'),
             (N'Директор школи', N'Директор школи'),
             (N'Практичний психолог', N'Практичний психолог'),
             (N'Соціальний педагог', N'Соціальний педагог'),
             (N'Бібліотекар', N'Бібліотекар'),
             (N'Медична сестра', N'Медична сестра'),
             (N'Завгосп', N'Завгосп'),
             (N'Охоронець', N'Охоронець'),
             (N'Прибиральник службових приміщень', N'Завгосп'),
             (N'Кухар', N'Медична сестра'),
             (N'Логопед', N'Практичний психолог'),
             (N'Дефектолог', N'Практичний психолог'),
             (N'Методист', N'Заступник директора з навчальної роботи')
     ) AS Data(PositionName, ResponsibilityName)
         INNER JOIN Positions p ON p.Name = Data.PositionName
         INNER JOIN Responsibilities r ON r.Name = Data.ResponsibilityName;